cli/dnsmasq.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-26 Tue 15:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>DNSMASQ</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">DNSMASQ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7abbad8">1. DHCP 服务器</a>
<ul>
<li><a href="#orgceff6d5">1.1. 配置文件</a></li>
<li><a href="#org98874c4">1.2. 执行</a></li>
<li><a href="#orgbf3485b">1.3. 测试</a>
<ul>
<li><a href="#org970a24b">1.3.1. 创建网络</a></li>
<li><a href="#org972e069">1.3.2. DHCP Server 容器</a></li>
<li><a href="#orgc9c8fdb">1.3.3. 测试容器</a>
<ul>
<li><a href="#org69bac49">1.3.3.1. 使用 dhtest 测试</a></li>
<li><a href="#orga072099">1.3.3.2. 使用 nmap 测试</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcd63573">2. DNS 服务器</a>
<ul>
<li><a href="#org5f20350">2.1. 指定上行真正的 DNS 服务器</a></li>
<li><a href="#orgd19d316">2.2. hosts 文件</a></li>
<li><a href="#org5c568f3">2.3. 执行</a></li>
</ul>
</li>
<li><a href="#orgf250fc9">3. TFTP 服务器 (readonly)</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-26 15:54:06</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7abbad8">1. DHCP 服务器</a>
<ul>
<li><a href="#orgceff6d5">1.1. 配置文件</a></li>
<li><a href="#org98874c4">1.2. 执行</a></li>
<li><a href="#orgbf3485b">1.3. 测试</a>
<ul>
<li><a href="#org970a24b">1.3.1. 创建网络</a></li>
<li><a href="#org972e069">1.3.2. DHCP Server 容器</a></li>
<li><a href="#orgc9c8fdb">1.3.3. 测试容器</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcd63573">2. DNS 服务器</a>
<ul>
<li><a href="#org5f20350">2.1. 指定上行真正的 DNS 服务器</a></li>
<li><a href="#orgd19d316">2.2. hosts 文件</a></li>
<li><a href="#org5c568f3">2.3. 执行</a></li>
</ul>
</li>
<li><a href="#orgf250fc9">3. TFTP 服务器 (readonly)</a></li>
</ul>
</div>
</div>


<div id="outline-container-org7abbad8" class="outline-2">
<h2 id="org7abbad8"><span class="section-number-2">1</span> DHCP 服务器</h2>
<div class="outline-text-2" id="text-1">
<p>
DHCP 服务器通常提供以下信息：
</p>

<ul class="org-ul">
<li>IP 地址</li>
<li>IP 地址的子网掩码</li>
<li>IP 地址的租约时间</li>
<li>网关地址</li>
<li>DNS 服务器地址</li>
</ul>
</div>


<div id="outline-container-orgceff6d5" class="outline-3">
<h3 id="orgceff6d5"><span class="section-number-3">1.1</span> 配置文件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>/etc/dnsmasq.d/dhcp.conf</code>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5fafff;">interface</span>=eth0                  <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#25351;&#23450;&#30417;&#21548;&#25509;&#21475;</span>
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#25351;&#23450;&#22320;&#22336;&#27744;&#65292;DHCP &#26381;&#21153;&#22120;&#33258;&#24049;&#30340; IP &#22320;&#22336;&#24517;&#39035;&#22312;&#27492;&#33539;&#22260;&#20869;</span>
dhcp-range=172.18.0.50,172.18.0.150,255.255.255.0,24h
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#20351;&#29992; option 6 &#21457;&#36865; DNS &#26381;&#21153;&#22120;&#20449;&#24687;</span>
dhcp-option=6,8.8.8.8,8.8.4.4
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#20351;&#29992; option 3 &#21457;&#36865;&#32593;&#20851;&#20449;&#24687;</span>
dhcp-option=3,172.18.0.1
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#22320;&#22336;&#20998;&#37197;&#21518;&#65292;&#35760;&#24405;&#25991;&#20214;&#30340;&#20301;&#32622;</span>
dhcp-leasefile=/dnsmasq/dnsmasq.leases

</pre>
</div>
</div>
</div>

<div id="outline-container-org98874c4" class="outline-3">
<h3 id="org98874c4"><span class="section-number-3">1.2</span> 执行</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>dnsmasq -k</code>
</p>
</div>
</div>

<div id="outline-container-orgbf3485b" class="outline-3">
<h3 id="orgbf3485b"><span class="section-number-3">1.3</span> 测试</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org970a24b" class="outline-4">
<h4 id="org970a24b"><span class="section-number-4">1.3.1</span> 创建网络</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<code>docker network create --subnet=192.168.0.0/24 dhcp</code>
</p>
</div>
</div>

<div id="outline-container-org972e069" class="outline-4">
<h4 id="org972e069"><span class="section-number-4">1.3.2</span> DHCP Server 容器</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">
<pre class="src src-sh">docker run -d <span style="color: #87af5f;">\</span>
       --network=dhcp <span style="color: #87af5f;">\</span>
       --rm <span style="color: #87af5f;">\</span>
       -v ~/dhcp.conf:/etc/dnsmasq.d/dhcp.conf <span style="color: #87af5f;">\</span>
       --cap-add=NET_ADMIN <span style="color: #87af5f;">\</span>
       andyshinn/dnsmasq <span style="color: #87af5f;">\</span>
       --log-facility=-
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc9c8fdb" class="outline-4">
<h4 id="orgc9c8fdb"><span class="section-number-4">1.3.3</span> 测试容器</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">
<pre class="src src-sh">docker run -d --rm <span style="color: #87af5f;">\</span>
       --cap-add=NET_ADMIN <span style="color: #87af5f;">\</span>
       --network=dhcp <span style="color: #87af5f;">\</span>
       --ip 192.168.0.200 <span style="color: #87af5f;">\</span>
       centos <span style="color: #87af5f;">\</span>
       sleep 1000000
</pre>
</div>
</div>

<div id="outline-container-org69bac49" class="outline-5">
<h5 id="org69bac49"><span class="section-number-5">1.3.3.1</span> 使用 <a href="https://github.com/saravana815/dhtest">dhtest</a> 测试</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<p>
<code>./dhtest -i eth0 -V -f</code>
</p>
</div>
</div>

<div id="outline-container-orga072099" class="outline-5">
<h5 id="orga072099"><span class="section-number-5">1.3.3.2</span> 使用 nmap 测试</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<p>
<code>nmap -e eth0 --script broadcast-dhcp-discover</code>
</p>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcd63573" class="outline-2">
<h2 id="orgcd63573"><span class="section-number-2">2</span> DNS 服务器</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5f20350" class="outline-3">
<h3 id="org5f20350"><span class="section-number-3">2.1</span> 指定上行真正的 DNS 服务器</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>/etc/dnsmasq.d/resolv.conf</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">nameserver 64.104.123.144
nameserver 8.8.8.8
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd19d316" class="outline-3">
<h3 id="orgd19d316"><span class="section-number-3">2.2</span> hosts 文件</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>/etc/dnsmasq.d/hosts.conf</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">1.2.3.4 host1
1.2.3.5 host2
1.2.3.6 host3
</pre>
</div>
</div>
</div>


<div id="outline-container-org5c568f3" class="outline-3">
<h3 id="org5c568f3"><span class="section-number-3">2.3</span> 执行</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">dnsmasq -k <span style="color: #87af5f;">\ </span>                   <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#21069;&#31471;&#25191;&#34892;</span>
--log-facility=- <span style="color: #87af5f;">\</span>
              --address /test.haoru.com/1.1.1.1 <span style="color: #87af5f;">\ </span><span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#28155;&#21152;&#22320;&#22336;</span>
              --address /test.fiona.com/2.2.2.2 <span style="color: #87af5f;">\</span>
              --addn-hosts=/etc/dnsmasq.d/hosts.conf <span style="color: #87af5f;">\ </span><span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">dnsmasq &#40664;&#35748;&#20250;&#21152;&#36733; /etc/dnsmasq.d/ &#30446;&#24405;&#19979;&#25152;&#26377; .conf &#32467;&#23614;&#30340;&#37197;&#32622;&#25991;&#20214;</span>
              --resolv-file=/etc/dnsmasq.d/resolv.conf

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf250fc9" class="outline-2">
<h2 id="orgf250fc9"><span class="section-number-2">3</span> TFTP 服务器 (readonly)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">dnsmasq -k <span style="color: #87af5f;">\</span>
        --enable-tftp <span style="color: #87af5f;">\</span>
        --log-facility=- <span style="color: #87af5f;">\</span>
        --tftp-root=&lt;filepath&gt; <span style="color: #87af5f;">\</span>
        --port=0                <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#31105;&#29992; DNS &#26381;&#21153;</span>
</pre>
</div>

<p>
<b>在Mac Docker上运行有问题</b></p>
</div>
</div>
</div>
</body>
</html>